БухЭксп/Catalogs/CW_Авиалинии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Авиалинии</Name>
			<Comment>Авиалинии</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Страны</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИАТА</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИКАО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Авиалинии/Forms/ФормаДобавленияИзКлассификатора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// заполнение из макета
	Макет = ПолучитьАвиалинииИзФТП(Отказ);
	Если Отказ Тогда 
		Возврат 
	КонецЕсли;
	
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		НовСтрока = ТаблицаЗагрузки.Добавить();
		НовСтрока.Наименование = Макет.Область(НомерСтроки, 2).Текст;
		НовСтрока.НаименованиеАнгл = Макет.Область(НомерСтроки, 1).Текст;
		Если ЗначениеЗаполнено(Справочники.CW_Авиалинии.НайтиПоНаименованию(НовСтрока.Наименование)) Тогда
			НовСтрока.ЕстьВБазе = Истина;
		КонецЕсли;
		НовСтрока.Страна = ВРег(Макет.Область(НомерСтроки, 3).Текст);
		НовСтрока.Адрес = Макет.Область(НомерСтроки, 4).Текст;
		НовСтрока.Телефон = Макет.Область(НомерСтроки, 5).Текст;
		НовСтрока.Email = Макет.Область(НомерСтроки, 6).Текст;
		НовСтрока.ГодОснования = Макет.Область(НомерСтроки,7).Текст;
		НовСтрока.КодИАТА = Макет.Область(НомерСтроки, 8).Текст;
		НовСтрока.КодИКАО = Макет.Область(НомерСтроки, 9).Текст;
		НовСтрока.Сайт = Макет.Область(НомерСтроки, 10).Текст;
		НовСтрока.Факс = Макет.Область(НомерСтроки, 11).Текст;
	КонецЦикла;
	УО = ЭтаФорма.УсловноеОформление; 
	УО.Элементы.Очистить(); 
	ЭлементУО = УО.Элементы.Добавить(); 

	Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить();  
	Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗагрузки"); 
	Оформляемоеполе.Использование = ИСТИНА; 


	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЗагрузки.ЕстьВБазе"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФОна",WebЦвета.СветлоЗеленый);
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере               
Функция ПолучитьАвиалинииИзФТП(Отказ);
	
	ДанныеАутентификации = CW_МониторПорталаПоддержкиСервер.ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ДанныеАутентификации = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны данные аутентификации пользователя на FTP-сервере",,,,Отказ);
	КонецЕсли;
	
	ПараметрыFTPПодключения = CW_РаботаСFTPРесурсами.ПолучитьПустуюСтруктуруНастроекFTP();   
	ПараметрыFTPПодключения.Логин  = ДанныеАутентификации.Логин;
	ПараметрыFTPПодключения.Пароль = ДанныеАутентификации.Пароль;

	CW_РаботаСFTPРесурсами.ЗаполнитьНастройкиFTPРесурса(ПараметрыFTPПодключения);	

   	FTPСоединение = CW_РаботаСFTPРесурсами.ПодключитьсяКFTPРесурсу(ПараметрыFTPПодключения);
	
	Если FTPСоединение = Неопределено Тогда
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить соединение с FTP-сервером",,,,Отказ);
	Конецесли;

	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Каталог = "/Reference/Airlines";
	FTPСоединение.УстановитьТекущийКаталог(Каталог);
	
	Если FTPСоединение.НайтиФайлы("Airlines.mxl").Количество() = 0 тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("mxl");
	FTPСоединение.Получить("Airlines.mxl",ВременныйФайл);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВременныйФайл);
	
	УдалитьФайлы(ВременныйФайл);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	колВоВыделенных = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Элементы.НадписьИтого.Заголовок = "Выделено "+колВоВыделенных+" из "+ТаблицаЗагрузки.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормыКлиент()
	
	колВоВыделенных = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Элементы.НадписьИтого.Заголовок = "Выделено "+колВоВыделенных+" из "+ТаблицаЗагрузки.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагрузкиПометкаПриИзменении(Элемент)
	
	фл = Элементы.ТаблицаЗагрузки.ТекущиеДанные.Пометка;
	Для Каждого ИдСтроки Из Элементы.ТаблицаЗагрузки.ВыделенныеСтроки Цикл
		СтрокаДФК = ТаблицаЗагрузки.НайтиПоИдентификатору(ИдСтроки);
		СтрокаДФК.Пометка = фл;
	КонецЦикла;
	
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для Каждого строкаКоллекции  Из ТаблицаЗагрузки Цикл
		строкаКоллекции.Пометка = Ложь;
	КонецЦикла;
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого строкаКоллекции  Из ТаблицаЗагрузки Цикл
		строкаКоллекции.Пометка = Истина;
	КонецЦикла;
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	// строки к загрузке
	колВоВыделенных = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Если колВоВыделенных=0 Тогда 
		_УФК.ВывестиПредупреждение("Не отмечено ни одной строки");
		Возврат;
	КонецЕсли;
	
	// поиск существующих по наименованию
	Ответ = _ПроверитьСуществованиеЗагружаемыхАвиалиний();         
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда 
		
		// добавим без дополнительных вопросов
		ВыполнитьЗагрузкуАвиалиний();
		
	Иначе 
		// часть линий найдена
		сз = Новый СписокЗначений;
		сз.Добавить(КодВозвратаДиалога.Да,         "Перезаписать все");
		сз.Добавить(КодВозвратаДиалога.Пропустить, "Пропустить найденные"); //"Пропустить существующие"//"Добавить только новые"
		сз.Добавить(КодВозвратаДиалога.Отмена,     "Отмена");
		// --- 
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаПерезаписиАвиалиний",ЭтотОбъект, Новый Структура("Ответ",Ответ)); 
		// --- 
		ПоказатьВопрос(ПОВ,
			"В справочнике уже существуют авиалинии :"+Ответ.ОписаниеОшибки
			+ Символы.ПС + "Перезаписать существующие элементы справочника Авиалинии?",
			сз);
		
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаПерезаписиАвиалиний(КодВозврата, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если КодВозврата = КодВозвратаДиалога.Да Тогда 
		
		// добавляем все
		ВыполнитьЗагрузкуАвиалиний();
		
	ИначеЕсли КодВозврата = КодВозвратаДиалога.Пропустить Тогда 
		
		// снимем отметки у найденных
		Для Каждого наим Из ДополнительныеПараметры.Ответ.НайденныеНаименования Цикл
			масс = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка, Наименование", Истина, наим));
			Для Каждого СтрокаДФК Из масс Цикл
				СтрокаДФК.Пометка = Ложь;
			КонецЦикла;
		КонецЦикла;
		ВыполнитьЗагрузкуАвиалиний();
		
	Иначе 
		
		// отмена
		Возврат;
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ВыполнитьЗагрузкуАвиалиний()
	// --- 
	
	// создание новых
	Ответ = _ЗагрузитьАвиалинии();
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда 
		ЭтаФорма.ОповеститьОЗаписиНового(Ответ.Ссылка);
		_УФК.ВывестиПредупреждение("Добавлено авиалиний: "+Ответ.КоличествоДобавлено);
	Иначе 
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПроверитьСуществованиеЗагружаемыхАвиалиний()
	
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаЗагрузки.Наименование КАК НаименованиеИзКоллекции
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&ТаблицаЗагрузки КАК ТаблицаЗагрузки
		|ГДЕ
		|	ТаблицаЗагрузки.Пометка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_Авиалинии.Наименование КАК НаименованиеИзСправочника,
		|	вт.НаименованиеИзКоллекции
		|ИЗ
		|	Справочник.CW_Авиалинии КАК CW_Авиалинии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО CW_Авиалинии.Наименование = вт.НаименованиеИзКоллекции"
	);
	з.УстановитьПараметр("ТаблицаЗагрузки", ТаблицаЗагрузки.Выгрузить(Новый Структура("Пометка", Истина)));
	тз = з.Выполнить().Выгрузить();	
	
	Если тз.Количество()=0 Тогда                                   
		Возврат _УФКС.Ответ();
		
	Иначе 
		КоличествоУжеСуществует = тз.Количество();
		ОтображатьNПервых = 8;
		стр="";
		Для ы=0 По Мин(КоличествоУжеСуществует, ОтображатьNПервых)-1 Цикл
			СтрокаТЗ = тз[ы];
			стр = стр + Символы.ПС + тз[ы].НаименованиеИзСправочника;
		КонецЦикла;
		Если КоличествоУжеСуществует>ОтображатьNПервых Тогда 
			стр = стр + Символы.ПС + "и ещё "+(КоличествоУжеСуществует-ОтображатьNПервых)+"...";
		КонецЕсли;
		
		СтруктураОтвета = _УФКС.Ответ(КоличествоУжеСуществует, стр);
		СтруктураОтвета.Вставить("НайденныеНаименования", тз.ВыгрузитьКолонку("НаименованиеИзКоллекции"));
		Возврат СтруктураОтвета;
	
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Функция _ЗагрузитьАвиалинии()
	
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("Ссылка", Справочники.CW_Авиалинии.ПустаяСсылка()); // достаточно вернуть хотя бы одну ссылку
	Ответ.Вставить("КоличествоДобавлено", 0);

	массСтрок = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого строкаДФК Из массСтрок Цикл	
		об = Справочники.CW_Авиалинии.НайтиПоНаименованию(строкаДФК.Наименование);
		Если ЗначениеЗаполнено(об) Тогда
			об = об.ПолучитьОбъект();
		Иначе
			об = Справочники.CW_Авиалинии.СоздатьЭлемент();
		КонецЕсли;
		об.Наименование = строкаДФК.Наименование;
		об.НаименованиеАнгл = строкаДФК.НаименованиеАнгл;
		Страна = ПроверитьСтрану(строкаДФК.Страна);
		об.Страна = Страна.Ссылка;
		об.Адрес = строкаДФК.Адрес;
		об.Телефон = строкаДФК.Телефон;
		об.Email = строкаДФК.Email;
		об.ГодОснования = строкаДФК.ГодОснования;
		об.КодИАТА = строкаДФК.КодИАТА;
		об.КодИКАО = строкаДФК.КодИКАО;
		об.Сайт = строкаДФК.Сайт;
		об.Факс = строкаДФК.Факс;
		Попытка
			об.Записать();
			Ответ.КоличествоДобавлено = Ответ.КоличествоДобавлено + 1;
		Исключение
			Возврат _УФКС.Ответ(1, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПроверитьСтрану(Страна) 
	
	Возврат Справочники.СтраныМира.НайтиПоНаименованию(Страна); 
	
КонецФункции
